starter-kit-ruby.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Ruby</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Starter Kit Ruby"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-19T14:27+0200"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="stylesheets/styles.css">
             <link rel="stylesheet" href="stylesheets/org-pygments.css">

</head>
<body>

<div id="preamble">
<span><a title="home page" class="" href="http://xgarrido.dyndns.org/">home</a></span>
                     <span><a title="about" class="" href="http://xgarrido.dyndns.org/">about</a></span>
                     <span><a title="publication" class="" href="http://xgarrido.dyndns.org/">publication</a></span>
                     <span><a title="vitae" class="" href="http://xgarrido.dyndns.org/">vitae</a></span>
                     <span><a title="categories" class="" href="http://xgarrido.dyndns.org/">categories</a></span>
                     <span><a title="links" class="" href="http://xgarrido.dyndns.org/">links</a></span>
                     <span><a title="subscribe by RSS" class="" href="http://xgarrido.dyndns.org/">subscribe</a></span>
                     
</div>

<div id="content">
<h1 class="title">Starter Kit Ruby</h1>

<p>This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Starter Kit Ruby</h2>
<div class="outline-text-2" id="text-1">


<p>
Support for the <a href="http://www.ruby-lang.org/en/">Ruby</a> dynamic, open-source programming language.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">eval-after-load</span> 'ruby-mode
  '(<span class="org-keyword">progn</span>
     <span class="org-comment-delimiter">;; </span><span class="org-comment">work around possible elpa bug</span>
     (<span class="org-keyword">ignore-errors</span> (<span class="org-keyword">require</span> '<span class="org-constant">ruby-compilation</span>))
     (setq ruby-use-encoding-map nil)
     (add-hook 'ruby-mode-hook 'inf-ruby-keys)
     (define-key ruby-mode-map (kbd <span class="org-string">"RET"</span>) 'reindent-then-newline-and-indent)
     (define-key ruby-mode-map (kbd <span class="org-string">"C-M-h"</span>) 'backward-kill-word)
     (define-key ruby-mode-map (kbd <span class="org-string">"C-c l"</span>) <span class="org-string">"lambda"</span>)))
</pre>



<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-h r"</span>) 'ri)
</pre>



</div>

<div id="outline-container-additional-file-extensions" class="outline-3">
<h3 id="additional-file-extensions"><a name="sec-1-1" id="sec-1-1"></a>Rake files are ruby, too, as are gemspecs.</h3>
<div class="outline-text-3" id="text-additional-file-extensions">




<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.rake$"</span> . ruby-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"Rakefile$"</span> . ruby-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.gemspec$"</span> . ruby-mode))
</pre>


</div>

</div>

<div id="outline-container-ignore-rubinius" class="outline-3">
<h3 id="ignore-rubinius"><a name="sec-1-2" id="sec-1-2"></a>We never want to edit Rubinius bytecode</h3>
<div class="outline-text-3" id="text-ignore-rubinius">




<pre class="src src-emacs-lisp">(add-to-list 'completion-ignored-extensions <span class="org-string">".rbc"</span>)
</pre>


</div>

</div>

<div id="outline-container-rake" class="outline-3">
<h3 id="rake"><a name="sec-1-3" id="sec-1-3"></a>Rake</h3>
<div class="outline-text-3" id="text-rake">





<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">pcomplete/rake</span> ()
  <span class="org-doc">"Completion rules for the `</span><span class="org-doc"><span class="org-constant">ssh</span></span><span class="org-doc">' command."</span>
  (pcomplete-here (pcmpl-rake-tasks)))

(<span class="org-keyword">defun</span> <span class="org-function-name">pcmpl-rake-tasks</span> ()
   <span class="org-doc">"Return a list of all the rake tasks defined in the current</span>
<span class="org-doc">projects.  I know this is a hack to put all the logic in the</span>
<span class="org-doc">exec-to-string command, but it works and seems fast"</span>
   (delq nil (mapcar '(<span class="org-keyword">lambda</span>(line)
                        (<span class="org-keyword">if</span> (string-match <span class="org-string">"rake </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string"> ]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> line) (match-string 1 line)))
                     (split-string (shell-command-to-string <span class="org-string">"rake -T"</span>) <span class="org-string">"[\n]"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">rake</span> (task)
  (interactive (list (completing-read <span class="org-string">"Rake (default: default): "</span>
                                      (pcmpl-rake-tasks))))
  (shell-command-to-string (concat <span class="org-string">"rake "</span> (<span class="org-keyword">if</span> (= 0 (length task)) <span class="org-string">"default"</span> task))))
</pre>


</div>

</div>

<div id="outline-container-compilation" class="outline-3">
<h3 id="compilation"><a name="sec-1-4" id="sec-1-4"></a>Compilation</h3>
<div class="outline-text-3" id="text-compilation">

<p>Clear the compilation buffer between test runs.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">eval-after-load</span> 'ruby-compilation
  '(<span class="org-keyword">progn</span>
     (<span class="org-keyword">defadvice</span> <span class="org-function-name">ruby-do-run-w/compilation</span> (before kill-buffer (name cmdlist))
       (<span class="org-keyword">let</span> ((comp-buffer-name (format <span class="org-string">"*%s*"</span> name)))
         (<span class="org-keyword">when</span> (get-buffer comp-buffer-name)
           (<span class="org-keyword">with-current-buffer</span> comp-buffer-name
             (delete-region (point-min) (point-max))))))
     (ad-activate 'ruby-do-run-w/compilation)))
</pre>


</div>

</div>

<div id="outline-container-hooks" class="outline-3">
<h3 id="hooks"><a name="sec-1-5" id="sec-1-5"></a>Hooks</h3>
<div class="outline-text-3" id="text-hooks">




<pre class="src src-emacs-lisp">(add-hook 'ruby-mode-hook 'run-starter-kit-coding-hook)
</pre>



<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'ruby-mode-hook 'idle-highlight)</span>
</pre>


</div>

</div>

<div id="outline-container-flymake" class="outline-3">
<h3 id="flymake"><a name="sec-1-6" id="sec-1-6"></a>Flymake</h3>
<div class="outline-text-3" id="text-flymake">





<pre class="src src-emacs-lisp">(<span class="org-keyword">eval-after-load</span> 'ruby-mode
  '(<span class="org-keyword">progn</span>
     (<span class="org-keyword">require</span> '<span class="org-constant">flymake</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">Invoke ruby with '-c' to get syntax checking</span>
     (<span class="org-keyword">defun</span> <span class="org-function-name">flymake-ruby-init</span> ()
       (<span class="org-keyword">let*</span> ((temp-file (flymake-init-create-temp-buffer-copy
                          'flymake-create-temp-inplace))
              (local-file (file-relative-name
                           temp-file
                           (file-name-directory buffer-file-name))))
         (list <span class="org-string">"ruby"</span> (list <span class="org-string">"-c"</span> local-file))))

     (push '(<span class="org-string">".+\\.rb$"</span> flymake-ruby-init) flymake-allowed-file-name-masks)
     (push '(<span class="org-string">"Rakefile$"</span> flymake-ruby-init) flymake-allowed-file-name-masks)

     (push '(<span class="org-string">"^</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">:</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[0-9]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">: </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">$"</span> 1 2 nil 3)
           flymake-err-line-patterns)

     (add-hook 'ruby-mode-hook
               (<span class="org-keyword">lambda</span> ()
                 (<span class="org-keyword">when</span> (and buffer-file-name
                            (file-writable-p
                             (file-name-directory buffer-file-name))
                            (file-writable-p buffer-file-name))
                   (local-set-key (kbd <span class="org-string">"C-c d"</span>)
                                  'flymake-display-err-menu-for-current-line)
                   (flymake-mode t))))))
</pre>


</div>

</div>

<div id="outline-container-rinari" class="outline-3">
<h3 id="rinari"><a name="sec-1-7" id="sec-1-7"></a>Rinari (Minor Mode for Ruby On Rails)</h3>
<div class="outline-text-3" id="text-rinari">

<p>See <a href="http://rinari.rubyforge.org/">rinari.rubyforge</a> for more information on rinari.
</p>



<pre class="src src-emacs-lisp">(setq rinari-major-modes
      (list 'mumamo-after-change-major-mode-hook 'dired-mode-hook 'ruby-mode-hook
            'css-mode-hook 'yaml-mode-hook 'javascript-mode-hook))
</pre>

</div>
</div>
</div>
</div>

</body>
</html>
